<?php

return [
    'singular' => 'الخاصية',
    'plural' => 'الخصائص',
    'empty' => 'لا يوجد خصائص حتى الان',
    'count' => 'عدد الخصائص',
    'search' => 'بحث',
    'select' => 'اختر الخاصية',
    'permission' => 'ادارة الخصائص',
    'trashed' => 'الخصائص المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن خاصية',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة خاصية',
        'show' => 'عرض الخاصية',
        'edit' => 'تعديل الخاصية',
        'delete' => 'حذف الخاصية',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الخاصية بنجاح.',
        'updated' => 'تم تعديل الخاصية بنجاح.',
        'deleted' => 'تم حذف الخاصية بنجاح.',
        'restored' => 'تم استعادة الخاصية بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الخاصية',
        'description' => 'وصف الخاصية',
        'value' => 'قيمة الخاصية',
        'unit' => 'وحدة القيمة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الخاصية ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الخاصية ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الخاصية نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],

    'units' => [
        '%' => '%',
        'kg' => 'kg',
        'g' => 'g',
        'm' => 'm',
        'cm' => 'cm',
        'l' => 'l',
        'ml' => 'ml',
        'mg' => 'mg',
    ]
];
