<?php

return [
    'singular' => 'الحجز',
    'plural' => 'الحجوزات',
    'empty' => 'لا يوجد حجوزات حتى الان',
    'count' => 'عدد الحجوزات',
    'search' => 'بحث',
    'select' => 'اختر الحجز',
    'permission' => 'ادارة الحجوزات',
    'trashed' => 'الحجوزات المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن حجز',
    'no_bookings' => 'لا يوجد حجوزات حتى الان',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة حجز',
        'show' => 'عرض الحجز',
        'edit' => 'تعديل الحجز',
        'delete' => 'حذف الحجز',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الحجز بنجاح.',
        'updated' => 'تم تعديل الحجز بنجاح.',
        'deleted' => 'تم حذف الحجز بنجاح.',
        'restored' => 'تم استعادة الحجز بنجاح.',
    ],
    'attributes' => [
        'service_id' => 'الخدمة',
        'inputs' => 'إختيارات الحجز',
        'files' => 'ملفات الحجز',
        'created_at' => 'تاريخ الحجز',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الحجز ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الحجز ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الحجز نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
