<?php

return [
    'singular' => 'الفرع',
    'plural' => 'الفروع',
    'empty' => 'لا يوجد فروع حتى الان',
    'count' => 'عدد الفروع',
    'search' => 'بحث',
    'select' => 'اختر الفرع',
    'permission' => 'ادارة الفروع',
    'trashed' => 'الفروع المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن فرع',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة فرع',
        'show' => 'عرض الفرع',
        'edit' => 'تعديل الفرع',
        'delete' => 'حذف الفرع',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الفرع بنجاح.',
        'updated' => 'تم تعديل الفرع بنجاح.',
        'deleted' => 'تم حذف الفرع بنجاح.',
        'restored' => 'تم استعادة الفرع بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الفرع',
        'phone' => 'رقم الهاتف',
        'address' => 'العنوان',
        'location_url' => 'رابط الموقع',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الفرع ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الفرع ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الفرع نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
