<?php

return [
    'singular' => 'المعرض',
    'plural' => 'المعارض',
    'empty' => 'لا يوجد معارض حتى الان',
    'count' => 'عدد المعارض',
    'search' => 'بحث',
    'select' => 'اختر المعرض',
    'permission' => 'ادارة المعارض',
    'trashed' => 'المعارض المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن معرض',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة معرض',
        'show' => 'عرض المعرض',
        'edit' => 'تعديل المعرض',
        'delete' => 'حذف المعرض',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المعرض بنجاح.',
        'updated' => 'تم تعديل المعرض بنجاح.',
        'deleted' => 'تم حذف المعرض بنجاح.',
        'restored' => 'تم استعادة المعرض بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم المعرض',
        'image' => 'صورة المعرض',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المعرض ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة المعرض ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المعرض نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
