<?php

return [
    'singular' => 'تنبيه الكمية',
    'plural' => 'التنبيهات للكمية',
    'empty' => 'لا يوجد تنبيهات الكمية حتى الان',
    'count' => 'عدد التنبيهات للكمية',
    'search' => 'بحث',
    'select' => 'اختر تنبيه الكمية',
    'permission' => 'ادارة التنبيهات للكمية',
    'trashed' => 'التنبيهات للكمية المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن تنبيه الكمية',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'تم اضافة التنبيه ',
        'show' => 'عرض تنبيه الكمية',
        'edit' => 'تعديل تنبيه الكمية',
        'delete' => 'حذف تنبيه الكمية',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'done' => 'تم',
        'undone' => 'لم يتم',
    ],
    'messages' => [
        'created' => 'تم اضافة تنبيه الكمية بنجاح.',
        'updated' => 'تم تعديل تنبيه الكمية بنجاح.',
        'deleted' => 'تم حذف تنبيه الكمية بنجاح.',
        'restored' => 'تم استعادة تنبيه الكمية بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم تنبيه الكمية',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف تنبيه الكمية ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة تنبيه الكمية ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف تنبيه الكمية نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
