<?php

return [
    'singular' => 'الفاتورة',
    'plural' => 'الفواتير',
    'empty' => 'لا يوجد فواتير حتى الان',
    'count' => 'عدد الفواتير',
    'search' => 'بحث',
    'select' => 'اختر الفاتورة',
    'permission' => 'ادارة الفواتير',
    'trashed' => 'الفواتير المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن فاتورة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة فاتورة',
        'show' => 'عرض الفاتورة',
        'edit' => 'تعديل الفاتورة',
        'delete' => 'حذف الفاتورة',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الفاتورة بنجاح.',
        'updated' => 'تم تعديل الفاتورة بنجاح.',
        'deleted' => 'تم حذف الفاتورة بنجاح.',
        'restored' => 'تم استعادة الفاتورة بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الفاتورة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الفاتورة ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الفاتورة ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الفاتورة نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
