<?php

return [
    'plural' => 'الصفحات',
    'singular' => 'الصفحه',
    'empty' => 'لا توجد صفحات',
    'select' => 'اختر الصفحه',
    'select-type' => 'الكل',
    'perPage' => 'عدد النتائج في الصفحة',
    'filter' => 'ابحث عن صفحه',
    'actions' => [
        'list' => 'عرض الكل ',
        'show' => 'عرض',
        'create' => 'إضافة صفحه جديدة',
        'edit' => 'تعديل  الصفحه',
        'delete' => 'حذف الصفحه',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة الصفحه بنجاح .',
        'updated' => 'تم تعديل الصفحه بنجاح .',
        'deleted' => 'تم حذف الصفحه بنجاح .',
    ],
    'attributes' => [
        'title' => 'اسم الصفحه',
        '%title%' => 'اسم الصفحه',
        'content' => 'محتوي الصفحه',
        '%content%' => 'محتوي الصفحه',
    ],
    'default' => [
        'name' => 'اسم الصفحه',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه الصفحه ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],

];
