<?php

return [
    'singular' => 'المنشور',
    'plural' => 'المنشورات',
    'empty' => 'لا يوجد منشورات حتى الان',
    'count' => 'عدد المنشورات',
    'search' => 'بحث',
    'select' => 'اختر المنشور',
    'permission' => 'ادارة المنشورات',
    'trashed' => 'المنشورات المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن منشور',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة منشور',
        'show' => 'عرض المنشور',
        'edit' => 'تعديل المنشور',
        'delete' => 'حذف المنشور',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المنشور بنجاح.',
        'updated' => 'تم تعديل المنشور بنجاح.',
        'deleted' => 'تم حذف المنشور بنجاح.',
        'restored' => 'تم استعادة المنشور بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم المنشور',
        '%name%' => 'اسم المنشور',
        '%paragraph%' => 'وصف المنشور',
        'paragraph' => 'وصف المنشور',
        'image' => 'صورة المنشور',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المنشور ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة المنشور ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المنشور نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
