<?php

return [
    'singular' => 'السلايدر',
    'plural' => 'السلايدرات',
    'empty' => 'لا يوجد سلايدرات حتى الان',
    'count' => 'عدد السلايدرات',
    'search' => 'بحث',
    'select' => 'اختر السلايدر',
    'permission' => 'ادارة السلايدرات',
    'trashed' => 'السلايدرات المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن سلايدر',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة سلايدر',
        'show' => 'عرض السلايدر',
        'edit' => 'تعديل السلايدر',
        'delete' => 'حذف السلايدر',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة السلايدر بنجاح.',
        'updated' => 'تم تعديل السلايدر بنجاح.',
        'deleted' => 'تم حذف السلايدر بنجاح.',
        'restored' => 'تم استعادة السلايدر بنجاح.',
    ],
    'attributes' => [
        'paragraph' => 'النص الرئيسي',
        'paragraph2' => 'النص الثاني',
        'image' => 'الصورة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف السلايدر ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة السلايدر ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف السلايدر نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
