tags/<?php

return [
    'singular' => 'الوسم',
    'plural' => 'الوسوم',
    'empty' => 'لا يوجد وسوم حتى الان',
    'count' => 'عدد الوسوم',
    'search' => 'بحث',
    'select' => 'اختر الوسم',
    'permission' => 'ادارة الوسوم',
    'trashed' => 'الوسوم المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن الوسوم',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة الوسوم',
        'show' => 'عرض الوسم',
        'edit' => 'تعديل الوسم',
        'delete' => 'حذف الوسم',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الوسم بنجاح.',
        'updated' => 'تم تعديل الوسم بنجاح.',
        'deleted' => 'تم حذف الوسم بنجاح.',
        'restored' => 'تم استعادة الوسم بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الوسم',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الوسم ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الوسم ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الوسم نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
