<?php

return [
    'singular' => 'الفريق',
    'plural' => 'الفرق',
    'empty' => 'لا يوجد فرق حتى الان',
    'count' => 'عدد الفرق',
    'search' => 'بحث',
    'select' => 'اختر الفريق',
    'permission' => 'ادارة الفرق',
    'trashed' => 'الفرق المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن فريق',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة فريق',
        'show' => 'عرض الفريق',
        'edit' => 'تعديل الفريق',
        'delete' => 'حذف الفريق',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الفريق بنجاح.',
        'updated' => 'تم تعديل الفريق بنجاح.',
        'deleted' => 'تم حذف الفريق بنجاح.',
        'restored' => 'تم استعادة الفريق بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الفريق',
        '%name%' => 'اسم الفريق',
        'title' => 'وظيفة الفريق',
        'image' => 'صورة الفريق',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الفريق ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة الفريق ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الفريق نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
