<?php

return [
    'singular' => 'التنوع',
    'plural' => 'التنوعات',
    'empty' => 'لا يوجد تنوعات حتى الان',
    'count' => 'عدد التنوعات',
    'search' => 'بحث',
    'select' => 'اختر التنوع',
    'permission' => 'ادارة التنوعات',
    'trashed' => 'التنوعات المحذوفة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن تنوع',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة تنوع',
        'show' => 'عرض التنوع',
        'edit' => 'تعديل التنوع',
        'delete' => 'حذف التنوع',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة التنوع بنجاح.',
        'updated' => 'تم تعديل التنوع بنجاح.',
        'deleted' => 'تم حذف التنوع بنجاح.',
        'restored' => 'تم استعادة التنوع بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم التنوع',
        'description' => 'وصف التنوع',
        'value' => 'قيمة التنوع',
        'unit' => 'وحدة القيمة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف التنوع ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة التنوع ؟',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف التنوع نهائياً ؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],

    'units' => [
        '%' => '%',
        'kg' => 'kg',
        'g' => 'g',
        'm' => 'm',
        'cm' => 'cm',
        'l' => 'l',
        'ml' => 'ml',
        'mg' => 'mg',
    ]
];
